In [12]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series, DataFrame

***常用的两个类***
## Series
--------
是一种一维的数组型对象,包含一个值序列(类似于NumPy中的类型),并且包含数据标签,称为索引index

In [3]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

也可以自己创建一个索引序列

In [7]:
obj2 = pd.Series([4,7,-5,3] , index=['a','b','c','d'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
obj2['a']

4

np.exp()函数是求e^{x}的值的函数。

In [13]:
np.exp(obj2)

a      54.598150
b    1096.633158
c       0.006738
d      20.085537
dtype: float64

可以把Series认为成一个长度固定且有序(根据索引来排序)的字典Dict,可以用字典生成一个Series

In [14]:
'b' in obj2

True

In [19]:
sdata = {'quanzhou': 1000,'fuzhou': 2000}
obj3 = pd.Series(sdata)
obj3

quanzhou    1000
fuzhou      2000
dtype: int64

In [20]:
pd.isnull(obj3)

quanzhou    False
fuzhou      False
dtype: bool

In [22]:
sdata2 = {'quanzhou': 1000,'xiamen': 2000}
obj4 = pd.Series(sdata2)
obj3 + obj4

fuzhou         NaN
quanzhou    2000.0
xiamen         NaN
dtype: float64

Series对象自身和其索引都有name属性

In [23]:
obj4.name = 'statics'
obj4.index.name = 'city'
obj4

city
quanzhou    1000
xiamen      2000
Name: statics, dtype: int64

## DataFrame
---------
df表示的是矩阵的数据表,包含**已排列**的列集合,每一列可以是不同的值类型.既有行索引也有列索引,可以被视为一个共享相同索引的Series的字典

In [25]:
data = {
    'user_id': [1,2,3],
    'user_name': ['luke','consonnm','zebao'],
    'user_gender': ['boy','?','boy']
}
frame = pd.DataFrame(data)
frame

   user_id user_name user_gender
0        1      luke         boy
1        2  consonnm           ?
2        3     zebao         boy

列的顺序是由自己设置的
似乎可以模拟数据库,继续往下学~

In [26]:
frame.loc[2]

user_id            3
user_name      zebao
user_gender      boy
Name: 2, dtype: object

In [28]:
frame2 = pd.DataFrame(data,columns=['user_id','user_name','user_gender','phone'],index=['one','two','three'])
frame2

       user_id user_name user_gender phone
one          1      luke         boy   NaN
two          2  consonnm           ?   NaN
three        3     zebao         boy   NaN

In [29]:
frame2['phone'] = '110'
frame2

       user_id user_name user_gender phone
one          1      luke         boy   110
two          2  consonnm           ?   110
three        3     zebao         boy   110

In [30]:
tall = pd.Series([1.8,1.8],index=['one','three'])
frame2['height'] = tall
frame2

       user_id user_name user_gender phone  height
one          1      luke         boy   110     1.8
two          2  consonnm           ?   110     NaN
three        3     zebao         boy   110     1.8

In [31]:
del frame2['phone']
frame2

       user_id user_name user_gender  height
one          1      luke         boy     1.8
two          2  consonnm           ?     NaN
three        3     zebao         boy     1.8

In [32]:
frame2.T

              one       two  three
user_id         1         2      3
user_name    luke  consonnm  zebao
user_gender   boy         ?    boy
height        1.8       NaN    1.8

In [34]:
frame2.index.name = 'id'
frame2.columns.name = 'info'
frame2

info   user_id user_name user_gender  height
id
one          1      luke         boy     1.8
two          2  consonnm           ?     NaN
three        3     zebao         boy     1.8

## 索引对象
------
索引对象是不可变的,用户不可修改索引对象